
//========================================================================
// Модуль для работы с данными конфигурации. Отвечает за:
// 	- получение данных
// 	- запись данных
//========================================================================

// Модули
Перем ОбъектнаяМодель, ОМКонфигурации, Конфигурация;

//========================================================================
// ИНИЦИАЛИЗАЦИЯ
//========================================================================

Процедура ПодключитьМодули()
	
	ОбъектнаяМодель		= Модуль("Модуль_ОбъектнаяМодель");
	ОМКонфигурации		= Модуль("Модуль_ОбъектнаяМодельКонфигурации");
	
	ТекущаяКонфигурация = ИнформацияОКонфигурации();
	ИмяКонфигурации = ТекущаяКонфигурация.Имя;
	Если ИмяКонфигурации = "УправлениеПроизводственнымПредприятием"
			ИЛИ ИмяКонфигурации = "КомплекснаяАвтоматизация" Тогда
		Конфигурация = Модуль("Модуль_ПоддержкаУПП");
	ИначеЕсли ИмяКонфигурации = "УправлениеТорговлей" Тогда
		Конфигурация = Модуль("Модуль_ПоддержкаУТ");
	ИначеЕсли ИмяКонфигурации = "БухгалтерияПредприятия" Тогда
		Конфигурация = Модуль("Модуль_ПоддержкаБух");
	ИначеЕсли ИмяКонфигурации = "БухгалтерияГосударственногоУчреждения" Тогда
		// TODO: Поддержка БГУ
		//Конфигурация = 
	Иначе
		// TODO: По идее тут надо вызвать исключение, но тогда клиенту придется самому эту строчку коментить,
		// если вдруг он захочет доработать под какую-то свою конфигурацию.
		//ВызватьИсключение "Не реализовано";
	КонецЕсли;
	
КонецПроцедуры

Процедура Инициализировать() Экспорт
	
	ПодключитьМодули();
	
КонецПроцедуры

//========================================================================
// ЭКСПОРТНЫЙ ИНТЕРФЕЙС
//========================================================================

// Конвертирует документ конфигурации в объект ИР.
// Никаких проверок, что это именно исходный документ не делается,
// и работа НЕ с исходным документом не гарантируется.
//
// Параметры:
//  Ссылка	 - ДокументСсылка - конвертируемый документ.
// 
// Возвращаемое значение:
//  Структура - объект ИР (см. Модуль_ОбъектнаяМодельКонфигурации.Новый_ИсходныйДокумент()).
//
Функция ИсходныйДокумент(Ссылка) Экспорт
	
	Документ = Конфигурация.ИсходныйДокумент(Ссылка);
	
	Возврат Документ;
	
КонецФункции

// Конвертирует документ конфигурации в объект ИР.
// Никаких проверок, что это именно корректировочный документ не делается,
// и работа НЕ с корректировочным документом не гарантируется.
//
// Параметры:
//  Ссылка	 - ДокументСсылка - конвертируемый документ.
// 
// Возвращаемое значение:
//  Структура - объект ИР (см. Модуль_ОбъектнаяМодельКонфигурации.Новый_КорректировочныйДокумент()).
//
Функция КорректировочныйДокумент(Ссылка) Экспорт
	
	Документ = Конфигурация.КорректировочныйДокумент(Ссылка);
	
	Возврат Документ;
	
КонецФункции

// Получает список документов, которые можно отправить в сервис.
//
// Параметры:
//  ДоступныеКонтрагенты - Массив - массив контрагентов, по которым ограничена выборка документов.
//  НачалоПериода		 - Дата - начало периода выборки.
//  КонецПериода		 - Дата - конец периода выборка.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - список документов для отправки (см. Модуль_ОбъектнаяМодель.Новый_СписокДокументовДляОтправки()).
//
Функция ПолучитьСписокДокументовДляОтправки(ДоступныеКонтрагенты, НачалоПериода = Неопределено, КонецПериода = Неопределено) Экспорт
	
	СписокДокументов = Конфигурация.ПолучитьСписокДокументовДляОтправки(ДоступныеКонтрагенты, НачалоПериода, КонецПериода);
	
	Возврат СписокДокументов;
	
КонецФункции

// Возвращает текущую организацию, с которой работает пользователь.
// 
// Возвращаемое значение:
//  Структура - организация в виде контрагента (см. Модуль_ОбъектнаяМодель.Новый_Контрагент()).
//
Функция ТекущаяОрганизация() Экспорт
	
	Результат = Конфигурация.ТекущаяОрганизация();
	
	Возврат Результат;
	
КонецФункции

// Конвертирует объект конфигурации в объект ИР.
//
// Параметры:
//  Ссылка	 - СправочникСсылка.Контрагенты - контрагент, который будет фактором.
// 
// Возвращаемое значение:
//  Структура - объект ИР, соответствующий объекту конфигурации (см. Модуль_ОбъектнаяМодель.Новый_Фактор()).
//
Функция Фактор(Ссылка) Экспорт
	
	Результат = Конфигурация.Фактор(Ссылка);
	
	Возврат Результат;
	
КонецФункции

// Получение полной информации о документе.
//
// Параметры:
//  Ссылка	 - ДокументСсылка - ссылка на документ, информацию о котором надо поучить.
// 
// Возвращаемое значение:
//  Структура - информация о документе, содержит всю необходимую информацию о документе 
// 				для его конвертации в объектную модель ИР (см. Модуль_ОбъектнаяМодельКонфигурации.Новый_ПолнаяИнформацияОДокументе()).
//
Функция ПолнаяИнформацияОДокументе(Ссылка) Экспорт
	
	Результат = Конфигурация.ПолнаяИнформацияОДокументе(Ссылка);
	
	Возврат Результат;
	
КонецФункции

// Получение краткой информации о документе.
//
// Параметры:
//  Ссылка	 - ДокументСсылка - ссылка на документ, информацию о котором надо поучить.
// 
// Возвращаемое значение:
//  Структура - информация о документе, содержим краткую информацию, такую как контрагент документа,
// 				существует ли документ в сервисе и его ИД в сервисе.
//
Функция ИнформацияОДокументе(Ссылка) Экспорт
	
	Результат = Конфигурация.ИнформацияОДокументе(Ссылка);
	
	Возврат Результат;
	
КонецФункции

// Устанавливает признак того, что документ отправлен и его ИД в сервисе.
//
// Параметры:
//  Ссылка		 - ДокументСсылка - ссылка на документ.
//  ИдДокумента	 - Строка - идентификатор документа в сервисе.
//
Процедура УстановитьДокументОтправлен(Ссылка, ИдДокумента) Экспорт
	
	Конфигурация.УстановитьДокументОтправлен(Ссылка, ИдДокумента);
	
КонецПроцедуры

Процедура УдалитьИдентитфикаторДокумента(ИдДокумента) Экспорт
	
	Конфигурация.УдалитьИдентитфикаторДокумента(ИдДокумента);
	
КонецПроцедуры

//========================================================================
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//========================================================================

