
Перем _ИмяФормы;

Перем ЗначениеВыбрано;

// Модули
Перем Телеметрия;
Перем СобытияТелеметрии;

Процедура ПодключитьМодули()
	
	Модули = ТребуютсяМодули("Модуль_Телеметрия");
	Телеметрия = Модули.Модуль_Телеметрия;
	
	СобытияТелеметрии = Телеметрия.ОписаниеСобытий();
	
КонецПроцедуры

Процедура ИнициализироватьФорму()
	
	ПодключитьМодули();
	
	ЗначениеВыбрано = Ложь;
	
КонецПроцедуры


//========================================================================
// ЭКСПОРТНЫЙ ИНТЕРФЕЙС
//========================================================================

Функция ИмяФормы() Экспорт
	
	Если _ИмяФормы = Неопределено Тогда
		_ИмяФормы = ПолучитьИмяФормы(ЭтаФорма);
	КонецЕсли;
	
	Возврат _ИмяФормы;
	
КонецФункции


Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Телеметрия.ОтправитьАналитику(
		СобытияТелеметрии.Криптография.ПолучениеДоступа,
		ЭтаФорма,
		Кнопка
	);
	
	ЗначениеВыбрано = Истина;
	
	Ответ = Новый Структура;
	Ответ.Вставить("Пароль", Пароль);
	Ответ.Вставить("СохранитьПароль", СохранитьПароль);
	
	ЭтаФорма.Закрыть(Ответ);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ЭтаФорма.Заголовок = "Введите пароль. Попытка " + (НомерПопытки + 1) + " из 3.";

КонецПроцедуры


Процедура ПриЗакрытии()
	
	Если НЕ ЗначениеВыбрано Тогда
		Телеметрия.ОтправитьАналитику(
			СобытияТелеметрии.Криптография.Отмена,
			ЭтаФорма
		);
	КонецЕсли;
	
КонецПроцедуры

ИнициализироватьФорму();

