
Процедура ПриОткрытии()
	
	Если СтруктураПараметров.ЭтоОтказ Тогда
		ЭтаФорма.Заголовок = "Отказ в приглашении к обмену от контрагента + [" + СтруктураПараметров.КонтрагентПредставление + "]";
		ЭлементыФормы.НадписьКомментарий.Заголовок = "Комментарий (причина) отказа:"
	Иначе
		ЭтаФорма.Заголовок = "Возобновление обмена с контрагентом + [" + СтруктураПараметров.КонтрагентПредставление + "]";
		ЭлементыФормы.НадписьКомментарий.Заголовок = "Комментарий к приглашению:"
	КонецЕсли;
	
КонецПроцедуры

Процедура ОсновныеДействияФормыСохранитьИЗакрыть(Кнопка)
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Комментарий", Комментарий);
	СтруктураОтвета.Вставить("ПодтверждениеОперации", Истина);
	ЭтаФорма.Закрыть(СтруктураОтвета);
	
КонецПроцедуры

Процедура ОсновныеДействияФормыОтменить(Кнопка)
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Комментарий", Комментарий);
	СтруктураОтвета.Вставить("ПодтверждениеОперации", Ложь);
	ЭтаФорма.Закрыть(СтруктураОтвета);
	
КонецПроцедуры


