
Перем _ИмяФормы;

//========================================================================
// ЭКСПОРТНЫЙ ИНТЕРФЕЙС
//========================================================================

Функция ИмяФормы() Экспорт
	
	Если _ИмяФормы = Неопределено Тогда
		_ИмяФормы = ПолучитьИмяФормы(ЭтаФорма);
	КонецЕсли;
	
	Возврат _ИмяФормы;
	
КонецФункции


Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	ЭтаФорма.Закрыть(ЭлементыФормы.ТЗ_СписокЯщиков.ТекущаяСтрока.Ящик);
	
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	ТЗ_СписокЯщиков.Колонки.Добавить("Ящик");
	Для Каждого ТекЯщик Из СписокЯщиков Цикл
		СтрокаТЗ = ТЗ_СписокЯщиков.Добавить();
		СтрокаТЗ.Ящик = ТекЯщик.Ящик;
		СтрокаТЗ.Организация = ТекЯщик.Ящик.OrganizationName;
		СтрокаТЗ.ИмяЯщика = ТекЯщик.Ящик.Address;
	КонецЦикла;
	
КонецПроцедуры

Процедура ТЗ_СписокЯщиковВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	ЭтаФорма.Закрыть(ВыбраннаяСтрока.Ящик);
	
КонецПроцедуры

