
Перем _ИмяФормы;

Перем БезОтвета;

// Модули
Перем Телеметрия;
Перем СобытияТелеметрии;

Процедура ПодключитьМодули()
	
	Модули = ТребуютсяМодули("Модуль_Телеметрия");
	Телеметрия = Модули.Модуль_Телеметрия;
	
	СобытияТелеметрии = Телеметрия.ОписаниеСобытий();

КонецПроцедуры

Процедура ИнициализироватьФорму()
	
	ПодключитьМодули();
	
	БезОтвета = Истина;
	
КонецПроцедуры

//========================================================================
// ЭКСПОРТНЫЙ ИНТЕРФЕЙС
//========================================================================

Функция ИмяФормы() Экспорт
	
	Если _ИмяФормы = Неопределено Тогда
		_ИмяФормы = ПолучитьИмяФормы(ЭтаФорма);
	КонецЕсли;
	
	Возврат _ИмяФормы;
	
КонецФункции


Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Ответ = Новый Структура;
	Ответ.Вставить("Отмена", Ложь);
	Ответ.Вставить("ДляВсех", ФлажокДляВсех);
	Ответ.Вставить("Комментарий", Комментарий);
	Закрыть(Ответ);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ЭтаФорма.Заголовок = "Введите комментарий к документу" + ?(ВсегоДокументов = 1, "", " (" + ТекущийДокумент + " из " + ВсегоДокументов + ")");
		
	Если ВсегоДокументов = 1 Тогда
		ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Удалить(ЭлементыФормы.ОсновныеДействияФормы.Кнопки.КнопкаОтменитьВсе);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОсновныеДействияФормыКнопкаОтменитьВсе(Кнопка)
	
	Телеметрия.ОтправитьАналитику(
		СобытияТелеметрии.Отправка.Отмена,
		ЭтаФорма,
		Кнопка, ,
		ВсегоДокументов - ТекущийДокумент + 1
	);
	
	БезОтвета = Ложь;
	
	Ответ = Новый Структура;
	Ответ.Вставить("Отмена", Истина);
	Ответ.Вставить("ДляВсех", Истина);
	Ответ.Вставить("Комментарий", Комментарий);
	Закрыть(Ответ);
	
КонецПроцедуры

Процедура ОсновныеДействияФормыКнопкаОтменить(Кнопка)
	
	Телеметрия.ОтправитьАналитику(
		СобытияТелеметрии.Отправка.Отмена,
		ЭтаФорма,
		Кнопка
	);
	
	БезОтвета = Ложь;
	
	Ответ = Новый Структура;
	Ответ.Вставить("Отмена", Истина);
	Ответ.Вставить("ДляВсех", Ложь);
	Ответ.Вставить("Комментарий", Комментарий);
	Закрыть(Ответ);
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	Если БезОтвета Тогда
		Телеметрия.ОтправитьАналитику(
			СобытияТелеметрии.Отправка.Отмена,
			ЭтаФорма
		);
	КонецЕсли;
	
КонецПроцедуры


ИнициализироватьФорму();
