
//========================================================================
// Форма заполнения реквизитов составителя документа.
// Используется для заполнения объекта Модуль_ОбъектнаяМодель.Новый_СоставительДокумента().
//========================================================================

Перем _Параметры;

// Модули
Перем ОбъектнаяМодель;

//========================================================================
// ИНИЦИАЛИЗАЦИЯ
//========================================================================

Процедура ПодключитьМодули()
	
	ОбъектнаяМодель = Модуль("Модуль_ОбъектнаяМодель");
	
КонецПроцедуры

Процедура Инициализировать()
	
	ПодключитьМодули();
	
КонецПроцедуры

Процедура ИнициализироватьФорму()
	
	Параметры = ПараметрыФормы();
	
	УстановитьСоставителя(Параметры.Модель);
	
КонецПроцедуры

Функция ПараметрыФормы()
	
	Если _Параметры = Неопределено Тогда
		ВызватьИсключение "Параметры формы не установлены";
	КонецЕсли;
	
	Возврат _Параметры;
	
КонецФункции

//========================================================================
// ЭКСПОРТНЫЙ ИНТЕРФЕЙС
//========================================================================

Функция Параметры() Экспорт
	
	Параметры = Новый Структура(
		"Модель"
	);
	
	Параметры.Модель = Неопределено; //: Модуль_ОбъектнаяМодель.Новый_СоставительДокумента();
	
	Возврат Параметры;
	
КонецФункции

Функция УстановитьПараметры(Параметры) Экспорт
	
	_Параметры = ФиксированныеДанные(Параметры);
	
КонецФункции

Функция ПроверяемыеРеквизиты() Экспорт
	
	Поля = Новый СписокЗначений;
	
	Поля.Добавить("НаименованиеОрганизации", НСтр("ru = 'Наименование экономического субъекта'"));
	
	Возврат Поля;
	
КонецФункции

//========================================================================
// СОБЫТИЯ
//========================================================================

//===================================
//{ События формы

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьФорму();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) Экспорт
	
	
	
КонецПроцедуры

//}

//===================================
//{ Кнопки формы

Процедура ОсновныеДействияФормыСохранить(Кнопка)
	
	Если НЕ ПроверитьЗаполнениеФормы(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	Сохранить();
	
КонецПроцедуры

//}

//===================================
//{ Команды

Процедура Сохранить()
	
	Результат = Составитель();
	ОповеститьОВыборе(Результат);
	
КонецПроцедуры

//}

//========================================================================
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//========================================================================

Процедура УстановитьСоставителя(НовоеЗначение)
	
	Если НовоеЗначение = Неопределено Тогда
		Составитель = ОбъектнаяМодель.Новый_СоставительДокумента();
	Иначе
		Составитель = НовоеЗначение;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Составитель, "НаименованиеОрганизации, ОснованиеПолномочий");
	
КонецПроцедуры

Функция Составитель()
	
	Составитель = ОбъектнаяМодель.Новый_СоставительДокумента();
	ЗаполнитьЗначенияСвойств(Составитель, ЭтаФорма, "НаименованиеОрганизации, ОснованиеПолномочий");
	
	Возврат Составитель;
	
КонецФункции


Инициализировать();

