
Перем _ИмяФормы;

//========================================================================
// ЭКСПОРТНЫЙ ИНТЕРФЕЙС
//========================================================================

Функция ИмяФормы() Экспорт
	
	Если _ИмяФормы = Неопределено Тогда
		_ИмяФормы = ПолучитьИмяФормы(ЭтаФорма);
	КонецЕсли;
	
	Возврат _ИмяФормы;
	
КонецФункции


Процедура ПриОткрытии()
	
	УстановитьЗаголовокОкна(ЭтаФорма, "О программе");
	ЭлементыФормы.Надпись_Версия.Заголовок = СтрШаблон2(ЭлементыФормы.Надпись_Версия.Заголовок, ВерсияИР());
	
КонецПроцедуры

Процедура Надпись_URLСайтаНажатие(Элемент)
	
	ЗапуститьПриложение(ЭлементыФормы.Надпись_URLСайта.Заголовок);
	
КонецПроцедуры

Процедура Надпись_URLТехподдержкиНажатие(Элемент)
	
	ЗапуститьПриложение("mailto:" + ЭлементыФормы.Надпись_URLТехподдержки.Заголовок);
	
КонецПроцедуры
